package java_easy_start.glava3;

/**
 * Создайте программу, в которой объявлены 2 переменные типа int и с ними выполняются арифметические операции:
 * сложение, вычитание, умножение и деление.
 * Результаты выведите на экран.
 */
public class Task_2 {
    public static void main(String[] args) {
        int num = 6;
        int num2 = 3;

        int res = num + num2;

        System.out.println(res);
    }
}
