package java_easy_start.glava3;

/**
 * 3. Создайте программу, в которой объявлены 2 переменные типа int и double. Выполните
 * с ними арифметические операции: сложение, вычитание, умножение и деление, – результат
 * должен быть типа double. Результаты выведите на экран.
 */
public class Task_3 {
    public static void main(String[] args) {
        int numInt = 555;
        double numDouble = 333;

        double res = numInt / numDouble;

        System.out.println(res);
    }
}
